keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_regdef.h
/** \\brief  ISP Acquisition Horizontal Offset Register */
typedef struct _Ifx_CIF_ISP_ACQ_H_OFFS_Bits
{
    Ifx_Strict_32Bit ACQ_H_OFFS:13;         /**< \brief [12:0] Horizontal sample offset (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ACQ_H_OFFS_Bits;

/** \\brief  ISP Acquisition Horizontal Size Register */
typedef struct _Ifx_CIF_ISP_ACQ_H_SIZE_Bits
{
    Ifx_Strict_32Bit ACQ_H_SIZE:13;         /**< \brief [12:0] Horizontal sample size (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ACQ_H_SIZE_Bits;

/** \\brief  ISP Acquisition Number of Frames Register */
typedef struct _Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits
{
    Ifx_Strict_32Bit ACQ_NR_FRAMES:10;      /**< \brief [9:0] Number of Input Frames (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits;

/** \\brief  ISP Acquisition Properties Register */
typedef struct _Ifx_CIF_ISP_ACQ_PROP_Bits
{
    Ifx_Strict_32Bit SAMPLE_EDGE:1;         /**< \brief [0:0] Sample Edge (rw) */
    Ifx_Strict_32Bit HSYNC_POL:1;           /**< \brief [1:1] Horizontal sync polarity (rw) */
    Ifx_Strict_32Bit VSYNC_POL:1;           /**< \brief [2:2] Vertical sync polarity (rw) */
    Ifx_Strict_32Bit reserved_3:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CCIR_SEQ:2;            /**< \brief [8:7] CCIR Sequence (rw) */
    Ifx_Strict_32Bit FIELD_SELECTION:2;     /**< \brief [10:9] Field Selection (rw) */
    Ifx_Strict_32Bit FIELD_INVERT:1;        /**< \brief [11:11] Field Invert (rw) */
    Ifx_Strict_32Bit INPUT_SELECTION:4;     /**< \brief [15:12] Input Selection (rw) */
    Ifx_Strict_32Bit reserved_16:4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit INPUT_SELECTION_NO_APP:1;  /**< \brief [20:20] Input Selection No Append (rw) */
    Ifx_Strict_32Bit reserved_21:11;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ACQ_PROP_Bits;

/** \\brief  ISP Acquistion Vertical Offset Register */
typedef struct _Ifx_CIF_ISP_ACQ_V_OFFS_Bits
{
    Ifx_Strict_32Bit ACQ_V_OFFS:12;         /**< \brief [11:0] Vertical sample offset (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ACQ_V_OFFS_Bits;

/** \\brief  ISP Acquisition Vertical Size Register */
typedef struct _Ifx_CIF_ISP_ACQ_V_SIZE_Bits
{
    Ifx_Strict_32Bit ACQ_V_SIZE:12;         /**< \brief [11:0] Vertical sample size (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ACQ_V_SIZE_Bits;

/** \\brief  ISP Global Control Register */
typedef struct _Ifx_CIF_ISP_CTRL_Bits
{
    Ifx_Strict_32Bit ISP_ENABLE:1;          /**< \brief [0:0] ISP output enable (rw) */
    Ifx_Strict_32Bit ISP_MODE:3;            /**< \brief [3:1] ISP Mode (rw) */
    Ifx_Strict_32Bit ISP_INFORM_ENABLE:1;   /**< \brief [4:4] ISP Input Formater Enable (rw) */
    Ifx_Strict_32Bit reserved_5:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ISP_CFG_UPD:1;         /**< \brief [9:9] ISP Config Update (w) */
    Ifx_Strict_32Bit ISP_GEN_CFG_UPD:1;     /**< \brief [10:10] ISP Generate Config Update (w) */
    Ifx_Strict_32Bit reserved_11:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ISP_CSM_Y_RANGE:1;     /**< \brief [13:13] Color Space Matrix luminance clipping range for ISP output (rw) */
    Ifx_Strict_32Bit ISP_CSM_C_RANGE:1;     /**< \brief [14:14] Color Space Matrix chrominance clipping range for ISP output (rw) */
    Ifx_Strict_32Bit reserved_15:17;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_CTRL_Bits;

/** \\brief  ISP Error Register */
typedef struct _Ifx_CIF_ISP_ERR_Bits
{
    Ifx_Strict_32Bit INFORM_SIZE_ERR:1;     /**< \brief [0:0] Size error is generated in inform submodule (r) */
    Ifx_Strict_32Bit IS_SIZE_ERR:1;         /**< \brief [1:1] Size error is generated in image stabilization submodule (r) */
    Ifx_Strict_32Bit OUTFORM_SIZE_ERR:1;    /**< \brief [2:2] Size error is generated in outmux submodule (r) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ERR_Bits;

/** \\brief  ISP Error Clear Register */
typedef struct _Ifx_CIF_ISP_ERR_CLR_Bits
{
    Ifx_Strict_32Bit INFORM_SIZE_ERR_CLR:1; /**< \brief [0:0] Size error is cleared (w) */
    Ifx_Strict_32Bit IS_SIZE_ERR_CLR:1;     /**< \brief [1:1] Size error is cleared (w) */
    Ifx_Strict_32Bit OUTFORM_SIZE_ERR_CLR:1;    /**< \brief [2:2] Size error is cleared (w) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ERR_CLR_Bits;

/** \\brief  ISP Shadow Flags Register */
typedef struct _Ifx_CIF_ISP_FLAGS_SHD_Bits
{
    Ifx_Strict_32Bit ISP_ENABLE_SHD:1;      /**< \brief [0:0] ISP enable shadow register (r) */
    Ifx_Strict_32Bit ISP_INFORM_ENABLE_SHD:1;   /**< \brief [1:1] Input formatter enable shadow register (r) */
    Ifx_Strict_32Bit INFORM_FIELD:1;        /**< \brief [2:2] Current field information (r) */
    Ifx_Strict_32Bit reserved_3:11;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit S_DATA:16;             /**< \brief [29:14] State of ISP input port s_data (r) */
    Ifx_Strict_32Bit S_VSYNC:1;             /**< \brief [30:30] State of ISP input port s_vsync (r) */
    Ifx_Strict_32Bit S_HSYNC:1;             /**< \brief [31:31] State of ISP input port s_hsync (r) */
} Ifx_CIF_ISP_FLAGS_SHD_Bits;

/** \\brief  ISP Frame Counter Register */
typedef struct _Ifx_CIF_ISP_FRAME_COUNT_Bits
{
    Ifx_Strict_32Bit FRAME_COUNTER:10;      /**< \brief [9:0] Current Frame Count of Processing (r) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_FRAME_COUNT_Bits;

/** \\brief  ISP Interrupt Clear Register */
typedef struct _Ifx_CIF_ISP_ICR_Bits
{
    Ifx_Strict_32Bit ICR_ISP_OFF:1;         /**< \brief [0:0] Isp was Turned Off (vsynced) (w) */
    Ifx_Strict_32Bit ICR_FRAME:1;           /**< \brief [1:1] Frame was Completely Put Out (w) */
    Ifx_Strict_32Bit ICR_DATA_LOSS:1;       /**< \brief [2:2] Loss of Data (w) */
    Ifx_Strict_32Bit ICR_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred (w) */
    Ifx_Strict_32Bit reserved_4:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ICR_FRAME_IN:1;        /**< \brief [5:5] Sampled Input Frame is Complete (w) */
    Ifx_Strict_32Bit ICR_V_START:1;         /**< \brief [6:6] Start Edge of v_sync (w) */
    Ifx_Strict_32Bit ICR_H_START:1;         /**< \brief [7:7] Start Edge of h_sync (w) */
    Ifx_Strict_32Bit reserved_8:11;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ICR_WD_TRIG:1;         /**< \brief [19:19] A watchdog timeout was triggered at the ISP input (w) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ICR_Bits;

/** \\brief  ISP Interrupt Mask Register */
typedef struct _Ifx_CIF_ISP_IMSC_Bits
{
    Ifx_Strict_32Bit IMSC_ISP_OFF:1;        /**< \brief [0:0] Isp was Turned Off (vsynced) (rw) */
    Ifx_Strict_32Bit IMSC_FRAME:1;          /**< \brief [1:1] Frame was Completely Put Out (rw) */
    Ifx_Strict_32Bit IMSC_DATA_LOSS:1;      /**< \brief [2:2] Loss of Data (rw) */
    Ifx_Strict_32Bit IMSC_PIC_SIZE_ERR:1;   /**< \brief [3:3] Pic Size Violation Occurred (rw) */
    Ifx_Strict_32Bit reserved_4:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IMSC_FRAME_IN:1;       /**< \brief [5:5] Sampled Input Frame is Complete (rw) */
    Ifx_Strict_32Bit IMSC_V_START:1;        /**< \brief [6:6] Start Edge of v_sync (rw) */
    Ifx_Strict_32Bit IMSC_H_START:1;        /**< \brief [7:7] Start Edge of h_sync (rw) */
    Ifx_Strict_32Bit reserved_8:11;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IMSC_WD_TRIG:1;        /**< \brief [19:19] A watchdog timeout was triggered at the ISP input (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_IMSC_Bits;

/** \\brief  ISP Interrupt Set Register */
typedef struct _Ifx_CIF_ISP_ISR_Bits
{
    Ifx_Strict_32Bit ISR_ISP_OFF:1;         /**< \brief [0:0] Isp was Turned Off (vsynced) (w) */
    Ifx_Strict_32Bit ISR_FRAME:1;           /**< \brief [1:1] Frame was Completely Put Out (w) */
    Ifx_Strict_32Bit ISR_DATA_LOSS:1;       /**< \brief [2:2] Loss of Data (w) */
    Ifx_Strict_32Bit ISR_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred (w) */
    Ifx_Strict_32Bit reserved_4:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ISR_FRAME_IN:1;        /**< \brief [5:5] Sampled Input Frame is Complete (w) */
    Ifx_Strict_32Bit ISR_V_START:1;         /**< \brief [6:6] Start Edge of v_sync (w) */
    Ifx_Strict_32Bit ISR_H_START:1;         /**< \brief [7:7] Start Edge of h_sync (w) */
    Ifx_Strict_32Bit reserved_8:11;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ISR_WD_TRIG:1;         /**< \brief [19:19] A watchdog timeout was triggered at the ISP input (w) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_ISP_ISR_Bits;

