keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_regdef.h
/** \\brief  JPE Error Masked Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_ERROR_MIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit VLC_SYMBOL_ERR:1;      /**< \brief [4:4] VLC Symbol Error (r) */
    Ifx_Strict_32Bit reserved_5:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCT_ERR:1;             /**< \brief [7:7] DC Table Error (r) */
    Ifx_Strict_32Bit reserved_8:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit R2B_IMG_SIZE_ERR:1;    /**< \brief [9:9] R2B Image Size Error (r) */
    Ifx_Strict_32Bit VLC_TABLE_ERR:1;       /**< \brief [10:10] VLC Table Error (r) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ERROR_MIS_Bits;

/** \\brief  JPE Error Raw Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_ERROR_RIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit VLC_SYMBOL_ERR:1;      /**< \brief [4:4] VLC Symbol Error (r) */
    Ifx_Strict_32Bit reserved_5:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit DCT_ERR:1;             /**< \brief [7:7] DC Table Error (r) */
    Ifx_Strict_32Bit reserved_8:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit R2B_IMG_SIZE_ERR:1;    /**< \brief [9:9] R2B Image Size Error (r) */
    Ifx_Strict_32Bit VLC_TABLE_ERR:1;       /**< \brief [10:10] VLC Table Error (r) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_ERROR_RIS_Bits;

/** \\brief  JPE Command To Start Stream Header Generation Register */
typedef struct _Ifx_CIF_JPE_GEN_HEADER_Bits
{
    Ifx_Strict_32Bit GEN_HEADER:1;          /**< \brief [0:0] Generate Header (w) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_GEN_HEADER_Bits;

/** \\brief  JPE Header Mode Definition Register */
typedef struct _Ifx_CIF_JPE_HEADER_MODE_Bits
{
    Ifx_Strict_32Bit HEADER_MODE:2;         /**< \brief [1:0] Header Mode (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_HEADER_MODE_Bits;

/** \\brief  JPE Automatic Configuration Update Register */
typedef struct _Ifx_CIF_JPE_INIT_Bits
{
    Ifx_Strict_32Bit JP_INIT:1;             /**< \brief [0:0] JPEG Init (w) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_INIT_Bits;

/** \\brief  JPEG Picture Encoding Format Register */
typedef struct _Ifx_CIF_JPE_PIC_FORMAT_Bits
{
    Ifx_Strict_32Bit ENC_PIC_FORMAT:3;      /**< \brief [2:0] Picture Encoding Format (rw) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_PIC_FORMAT_Bits;

/** \\brief  JPE Restart Marker Insertion Register */
typedef struct _Ifx_CIF_JPE_RESTART_INTERVAL_Bits
{
    Ifx_Strict_32Bit RESTART_INTERVAL:16;   /**< \brief [15:0] Restart Interval (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_RESTART_INTERVAL_Bits;

/** \\brief  JPEG Status Interrupt Clear Register */
typedef struct _Ifx_CIF_JPE_STATUS_ICR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (w) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (w) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_ICR_Bits;

/** \\brief  JPEG Status Interrupt Mask Register */
typedef struct _Ifx_CIF_JPE_STATUS_IMR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (rw) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (rw) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_IMR_Bits;

/** \\brief  JPEG Status Interrupt Set Register */
typedef struct _Ifx_CIF_JPE_STATUS_ISR_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (w) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (w) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_ISR_Bits;

/** \\brief  JPEG Status Masked Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_STATUS_MIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (r) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (r) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_MIS_Bits;

/** \\brief  JPEG Status Raw Interrupt Status Register */
typedef struct _Ifx_CIF_JPE_STATUS_RIS_Bits
{
    Ifx_Strict_32Bit reserved_0:4;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ENCODE_DONE:1;         /**< \brief [4:4] Encoding Complete (r) */
    Ifx_Strict_32Bit GEN_HEADER_DONE:1;     /**< \brief [5:5] Header Generation Complete (r) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_STATUS_RIS_Bits;

/** \\brief  JPE Table Programming Register */
typedef struct _Ifx_CIF_JPE_TABLE_DATA_Bits
{
    Ifx_Strict_32Bit TABLE_WDATA_L:8;       /**< \brief [7:0] Table data LSB (w) */
    Ifx_Strict_32Bit TABLE_WDATA_H:8;       /**< \brief [15:8] Table data MSB (w) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TABLE_DATA_Bits;

/** \\brief  JPE Header Generation Debug Register */
typedef struct _Ifx_CIF_JPE_TABLE_FLUSH_Bits
{
    Ifx_Strict_32Bit TABLE_FLUSH:1;         /**< \brief [0:0] Header generation debug control flag (rw) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TABLE_FLUSH_Bits;

/** \\brief  JPE Table Programming Select Register */
typedef struct _Ifx_CIF_JPE_TABLE_ID_Bits
{
    Ifx_Strict_32Bit TABLE_ID:4;            /**< \brief [3:0] JPE Table ID (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TABLE_ID_Bits;

/** \\brief  JPE Huffman AC Table 0 Length Register */
typedef struct _Ifx_CIF_JPE_TAC0_LEN_Bits
{
    Ifx_Strict_32Bit TAC0_LEN:8;            /**< \brief [7:0] AC Table 0 Length (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TAC0_LEN_Bits;

/** \\brief  JPE Huffman AC Table 1 Length Register */
typedef struct _Ifx_CIF_JPE_TAC1_LEN_Bits
{
    Ifx_Strict_32Bit TAC1_LEN:8;            /**< \brief [7:0] AC Table 1 Length (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_CIF_JPE_TAC1_LEN_Bits;

