keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_regdef.h
/** \\brief  MI Extra Path Masked Interrupt Status Register */
typedef struct _Ifx_CIF_MIEP_MIS_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;      /**< \brief [0:0] Extra Path 1 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_1:1;           /**< \brief [1:1] Fill Extra Path 1 (r) */
    Ifx_Strict_32Bit WRAP_EP_1:1;           /**< \brief [2:2] Wrap Extra Path 1 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;      /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;      /**< \brief [4:4] Extra Path 2 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_2:1;           /**< \brief [5:5] Fill Extra Path 2 (r) */
    Ifx_Strict_32Bit WRAP_EP_2:1;           /**< \brief [6:6] Wrap Extra Path 2 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_2:1;      /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;      /**< \brief [8:8] Extra Path 3 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_3:1;           /**< \brief [9:9] Fill Extra Path 3 (r) */
    Ifx_Strict_32Bit WRAP_EP_3:1;           /**< \brief [10:10] Wrap Extra Path 3 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;      /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;      /**< \brief [12:12] Extra Path 4 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_4:1;           /**< \brief [13:13] Fill Extra Path 4 (r) */
    Ifx_Strict_32Bit WRAP_EP_4:1;           /**< \brief [14:14] Wrap Extra Path 4 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;      /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;      /**< \brief [16:16] Extra Path 5 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_5:1;           /**< \brief [17:17] Fill Extra Path 5 (r) */
    Ifx_Strict_32Bit WRAP_EP_5:1;           /**< \brief [18:18] Wrap Extra Path 5 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;      /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 (r) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_MIS_Bits;

/** \\brief  MI Extra Path Raw Interrupt Status Register */
typedef struct _Ifx_CIF_MIEP_RIS_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;      /**< \brief [0:0] Extra Path 1 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_1:1;           /**< \brief [1:1] Fill Extra Path 1 (r) */
    Ifx_Strict_32Bit WRAP_EP_1:1;           /**< \brief [2:2] Wrap Extra Path 1 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;      /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;      /**< \brief [4:4] Extra Path 2 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_2:1;           /**< \brief [5:5] Fill Extra Path 2 (r) */
    Ifx_Strict_32Bit WRAP_EP_2:1;           /**< \brief [6:6] Wrap Extra Path 2 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_2:1;      /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;      /**< \brief [8:8] Extra Path 3 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_3:1;           /**< \brief [9:9] Fill Extra Path 3 (r) */
    Ifx_Strict_32Bit WRAP_EP_3:1;           /**< \brief [10:10] Wrap Extra Path 3 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;      /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;      /**< \brief [12:12] Extra Path 4 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_4:1;           /**< \brief [13:13] Fill Extra Path 4 (r) */
    Ifx_Strict_32Bit WRAP_EP_4:1;           /**< \brief [14:14] Wrap Extra Path 4 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;      /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;      /**< \brief [16:16] Extra Path 5 Frame End (r) */
    Ifx_Strict_32Bit FILL_EP_5:1;           /**< \brief [17:17] Fill Extra Path 5 (r) */
    Ifx_Strict_32Bit WRAP_EP_5:1;           /**< \brief [18:18] Wrap Extra Path 5 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;      /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 (r) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_RIS_Bits;

/** \\brief  Extra Path Error Register */
typedef struct _Ifx_CIF_MIEP_STA_ERR_Bits
{
    Ifx_Strict_32Bit reserved_0:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EP_1_IC_SIZE_ERR:1;    /**< \brief [1:1] Size error is generated in Extra Path 1 image cropping submodule (r) */
    Ifx_Strict_32Bit EP_2_IC_SIZE_ERR:1;    /**< \brief [2:2] Size error is generated in Extra Path 2 image cropping submodule (r) */
    Ifx_Strict_32Bit EP_3_IC_SIZE_ERR:1;    /**< \brief [3:3] Size error is generated in Extra Path 3 image cropping submodule (r) */
    Ifx_Strict_32Bit EP_4_IC_SIZE_ERR:1;    /**< \brief [4:4] Size error is generated in Extra Path 4 image cropping submodule (r) */
    Ifx_Strict_32Bit EP_5_IC_SIZE_ERR:1;    /**< \brief [5:5] Size error is generated in Extra Path 5 image cropping submodule (r) */
    Ifx_Strict_32Bit reserved_6:11;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EP_1_FIFO_FULL:1;      /**< \brief [17:17] Extra Path 1 FIFO Full (r) */
    Ifx_Strict_32Bit EP_2_FIFO_FULL:1;      /**< \brief [18:18] Extra Path 2 FIFO Full (r) */
    Ifx_Strict_32Bit EP_3_FIFO_FULL:1;      /**< \brief [19:19] Extra Path 3 FIFO Full (r) */
    Ifx_Strict_32Bit EP_4_FIFO_FULL:1;      /**< \brief [20:20] Extra Path 4 FIFO Full (r) */
    Ifx_Strict_32Bit EP_5_FIFO_FULL:1;      /**< \brief [21:21] Extra Path 5 FIFO Full (r) */
    Ifx_Strict_32Bit reserved_22:10;        /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_STA_ERR_Bits;

/** \\brief  Extra Path Error Clear Register */
typedef struct _Ifx_CIF_MIEP_STA_ERR_CLR_Bits
{
    Ifx_Strict_32Bit reserved_0:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EP_1_IC_SIZE_ERR_CLR:1;    /**< \brief [1:1] Size error is cleared (w) */
    Ifx_Strict_32Bit EP_2_IC_SIZE_ERR_CLR:1;    /**< \brief [2:2] Size error is cleared (w) */
    Ifx_Strict_32Bit EP_3_IC_SIZE_ERR_CLR:1;    /**< \brief [3:3] Size error is cleared (w) */
    Ifx_Strict_32Bit EP_4_IC_SIZE_ERR_CLR:1;    /**< \brief [4:4] Size error is cleared (w) */
    Ifx_Strict_32Bit EP_5_IC_SIZE_ERR_CLR:1;    /**< \brief [5:5] Size error is cleared (w) */
    Ifx_Strict_32Bit reserved_6:26;         /**< \brief \internal Reserved */
} Ifx_CIF_MIEP_STA_ERR_CLR_Bits;

