keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_regdef.h
/** \\brief  Memory Interface Size Shadow Register of Main Picture Y
 * Component,JPEG or RAW Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits B;
} Ifx_CIF_MI_MP_Y_SIZE_SHD;

/** \\brief  MI Raw Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MI_RIS_Bits B;
} Ifx_CIF_MI_RIS;

/** \\brief  MI Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MI_STATUS_Bits B;
} Ifx_CIF_MI_STATUS;

/** \\brief  MI Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MI_STATUS_CLR_Bits B;
} Ifx_CIF_MI_STATUS_CLR;

/** \\brief  Memory Interface Base Address For Extra Path Data Buffer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits B;
} Ifx_CIF_MIEP_CH_BASE_AD_INIT;

/** \\brief  Memory Interface Base Address Shadow Register for Extra Path Buffer
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits B;
} Ifx_CIF_MIEP_CH_BASE_AD_SHD;

/** \\brief  Memory Interface Extra Path Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_CTRL_Bits B;
} Ifx_CIF_MIEP_CH_CTRL;

/** \\brief  Memory Interface Extra Path Control Internal Shadow Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_CTRL_SHD_Bits B;
} Ifx_CIF_MIEP_CH_CTRL_SHD;

/** \\brief  Memory Interface Extra Path Control Register For Address Init And
 * Skip Function Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_INIT_Bits B;
} Ifx_CIF_MIEP_CH_INIT;

/** \\brief  Memory Interface Fill Level Interrupt Offset Value For Extra Path
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits B;
} Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT;

/** \\brief  Memory Interface Shadow Register of Fill Level Interrupt Offset
 * Value For Extra Path Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits B;
} Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD;

/** \\brief  Memory Interface Offset Counter Init Value For Extra Path Buffer
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits B;
} Ifx_CIF_MIEP_CH_OFFS_CNT_INIT;

/** \\brief  Memory Interface Current Offset Counter of Extra Path Buffer
 * Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits B;
} Ifx_CIF_MIEP_CH_OFFS_CNT_SHD;

/** \\brief  Memory Interface Offset Counter Start Value For Extra Path Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits B;
} Ifx_CIF_MIEP_CH_OFFS_CNT_START;

/** \\brief  Memory Interface Size of Extra Path Data Buffer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_SIZE_INIT_Bits B;
} Ifx_CIF_MIEP_CH_SIZE_INIT;

/** \\brief  Memory Interface Size Shadow Register of Extra Path Buffer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_CH_SIZE_SHD_Bits B;
} Ifx_CIF_MIEP_CH_SIZE_SHD;

/** \\brief  MI Extra Path Interrupt Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_ICR_Bits B;
} Ifx_CIF_MIEP_ICR;

/** \\brief  MI Extra Path Interrupt Mask ‘1’: interrupt active, ‘0’: interrupt
 * masked */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_IMSC_Bits B;
} Ifx_CIF_MIEP_IMSC;

/** \\brief  MI Extra Path Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_ISR_Bits B;
} Ifx_CIF_MIEP_ISR;

/** \\brief  MI Extra Path Masked Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_MIS_Bits B;
} Ifx_CIF_MIEP_MIS;

/** \\brief  MI Extra Path Raw Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_RIS_Bits B;
} Ifx_CIF_MIEP_RIS;

/** \\brief  Extra Path Error Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_STA_ERR_Bits B;
} Ifx_CIF_MIEP_STA_ERR;

/** \\brief  Extra Path Error Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_MIEP_STA_ERR_CLR_Bits B;
} Ifx_CIF_MIEP_STA_ERR_CLR;

