keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_regdef.h
/** \\brief  Watchdog Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_CTRL_Bits B;
} Ifx_CIF_WD_CTRL;

/** \\brief  Watchdog Horizontal Timeout Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_H_TIMEOUT_Bits B;
} Ifx_CIF_WD_H_TIMEOUT;

/** \\brief  Watchdog Interrupt Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_ICR_Bits B;
} Ifx_CIF_WD_ICR;

/** \\brief  Watchdog Interrupt Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_IMSC_Bits B;
} Ifx_CIF_WD_IMSC;

/** \\brief  Watchdog Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_ISR_Bits B;
} Ifx_CIF_WD_ISR;

/** \\brief  Watchdog Masked Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_MIS_Bits B;
} Ifx_CIF_WD_MIS;

/** \\brief  Watchdog Raw Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_RIS_Bits B;
} Ifx_CIF_WD_RIS;

/** \\brief  Watchdog Vertical Timeout Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CIF_WD_V_TIMEOUT_Bits B;
} Ifx_CIF_WD_V_TIMEOUT;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \\brief  Memory interface channel */
typedef volatile struct _Ifx_CIF_MIEP_CH
{
    Ifx_CIF_MIEP_CH_CTRL CTRL;              /**< \brief 0, Memory Interface Extra Path Control Register */
    Ifx_CIF_MIEP_CH_INIT INIT;              /**< \brief 4, Memory Interface Extra Path Control Register For Address Init And Skip Function Register */
    Ifx_CIF_MIEP_CH_BASE_AD_INIT BASE_AD_INIT;  /**< \brief 8, Memory Interface Base Address For Extra Path Data Buffer Register */
    Ifx_CIF_MIEP_CH_SIZE_INIT SIZE_INIT;    /**< \brief C, Memory Interface Size of Extra Path Data Buffer Register */
    Ifx_CIF_MIEP_CH_OFFS_CNT_INIT OFFS_CNT_INIT;    /**< \brief 10, Memory Interface Offset Counter Init Value For Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_OFFS_CNT_START OFFS_CNT_START;  /**< \brief 14, Memory Interface Offset Counter Start Value For Extra Path Register */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT IRQ_OFFS_INIT;    /**< \brief 18, Memory Interface Fill Level Interrupt Offset Value For Extra Path Register */
    Ifx_CIF_MIEP_CH_CTRL_SHD CTRL_SHD;      /**< \brief 1C, Memory Interface Extra Path Control Internal Shadow Register */
    Ifx_CIF_MIEP_CH_BASE_AD_SHD BASE_AD_SHD;    /**< \brief 20, Memory Interface Base Address Shadow Register for Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_SIZE_SHD SIZE_SHD;      /**< \brief 24, Memory Interface Size Shadow Register of Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_OFFS_CNT_SHD OFFS_CNT_SHD;  /**< \brief 28, Memory Interface Current Offset Counter of Extra Path Buffer Register */
    Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD IRQ_OFFS_SHD;  /**< \brief 2C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path Register */
    unsigned char reserved_30[208];         /**< \brief 30, \internal Reserved */
} Ifx_CIF_MIEP_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  BBB Object */
typedef volatile struct _Ifx_CIF_BBB
{
    Ifx_CIF_BBB_CLC CLC;                    /**< \brief 0, Clock Control Register */
    Ifx_CIF_BBB_MODID MODID;                /**< \brief 4, Module Identification Register */
    Ifx_CIF_BBB_GPCTL GPCTL;                /**< \brief 8, General Purpose Control Register */
    Ifx_CIF_BBB_ACCEN0 ACCEN0;              /**< \brief C, Access Enable Register 0 */
    Ifx_CIF_BBB_ACCEN1 ACCEN1;              /**< \brief 10, Access Enable Register 1 */
    Ifx_CIF_BBB_KRST0 KRST0;                /**< \brief 14, Kernel Reset Register 0 */
    Ifx_CIF_BBB_KRST1 KRST1;                /**< \brief 18, Kernel Reset Register 1 */
    Ifx_CIF_BBB_KRSTCLR KRSTCLR;            /**< \brief 1C, Kernel Reset Status Clear Register */
} Ifx_CIF_BBB;

/** \\brief  DP Object */
typedef volatile struct _Ifx_CIF_DP
{
    Ifx_CIF_DP_CTRL CTRL;                   /**< \brief 0, Debug Path Control Register */
    Ifx_CIF_DP_PDIV_CTRL PDIV_CTRL;         /**< \brief 4, Debug Path Predivider Control Register */
    Ifx_CIF_DP_FLC_STAT FLC_STAT;           /**< \brief 8, Debug Path Frame/Line Counter Status Register */
    Ifx_CIF_DP_PDIV_STAT PDIV_STAT;         /**< \brief C, Debug Path Predivider Counter Status Register */
    Ifx_CIF_DP_TSC_STAT TSC_STAT;           /**< \brief 10, Debug Path Timestamp Counter Status Register */
    Ifx_CIF_DP_UDS UDS_1S[8];               /**< \brief 14, Debug Path User Defined Symbol Register \note Array index shifted by 1. Example: defined register UDS_1S[0]/UDS_1S0 corresponds to user manual UDS_1S1, ... */
} Ifx_CIF_DP;

/** \\brief  EP Object */
typedef volatile struct _Ifx_CIF_EP_IC
{
    Ifx_CIF_EP_IC_CTRL CTRL;                /**< \brief 0, Extra Path Image Cropping Control Register */
    Ifx_CIF_EP_IC_RECENTER RECENTER;        /**< \brief 4, Extra Path Image Cropping Recenter Register */
    Ifx_CIF_EP_IC_H_OFFS H_OFFS;            /**< \brief 8, Extra Path Image Cropping Horizontal Offset of Output Window Register */
    Ifx_CIF_EP_IC_V_OFFS V_OFFS;            /**< \brief C, Extra Path Image Cropping Vertical Offset Of Output Window Register */
    Ifx_CIF_EP_IC_H_SIZE H_SIZE;            /**< \brief 10, Extra Path Image Cropping Output Horizontal Picture Size Register */
    Ifx_CIF_EP_IC_V_SIZE V_SIZE;            /**< \brief 14, Extra Path Image Cropping Output Vertical Picture Size Register */
    Ifx_CIF_EP_IC_MAX_DX MAX_DX;            /**< \brief 18, Extra Path Image Cropping Maximum Horizontal Displacement Register */
    Ifx_CIF_EP_IC_MAX_DY MAX_DY;            /**< \brief 1C, Extra Path Image Cropping Maximum Vertical Displacement Register */
    Ifx_CIF_EP_IC_DISPLACE DISPLACE;        /**< \brief 20, Extra Path Image Cropping Camera Displacement Register */
    Ifx_CIF_EP_IC_H_OFFS_SHD H_OFFS_SHD;    /**< \brief 24, Extra Path Image Current Horizontal Offset Of Output Window Shadow Register */
    Ifx_CIF_EP_IC_V_OFFS_SHD V_OFFS_SHD;    /**< \brief 28, Extra Path Image Current Vertical Offset Of Output Window Shadow Register */
    Ifx_CIF_EP_IC_H_SIZE_SHD H_SIZE_SHD;    /**< \brief 2C, Extra Path Image Current Output Horizontal Picture Size Shadow Register */
    Ifx_CIF_EP_IC_V_SIZE_SHD V_SIZE_SHD;    /**< \brief 30, Extra Path Image Current Output Vertical Picture Size Shadow Register */
    unsigned char reserved_34[204];         /**< \brief 34, \internal Reserved */
} Ifx_CIF_EP_IC;

